grime.org
#+TITLE: unis grime thign
#+OPTIONS: timestamp:nil author:nil todo:t H:6
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="grime_style.css" />
#+INFOJS_OPT: view:info toc:nil
#+begin_src emacs-lisp :exports none
(map! "C-c l n l" #'org-super-links-store-link)
(map! "C-c l l l" #'org-super-links-link)
(setq! yt-iframe-format
  ;; You may want to change your width and height.
  (concat "<p><iframe width=\"440\""
          " height=\"335\""
          " src=\"https://www.youtube.com/embed/%s\""
          " frameborder=\"0\""
          " allowfullscreen>%s</iframe></p>"))

(org-add-link-type
 "yt"
 (lambda (handle)
   (browse-url
    (concat "https://www.youtube.com/embed/"
            handle)))
 (lambda (path desc backend)
   (cl-case backend
     (html (format yt-iframe-format
                   path (or desc "")))
     (latex (format "\href{%s}{%s}"
                    path (or desc "video"))))))
#+end_src

#+RESULTS:
: Created yt link.

* Grime Tunes
not ordered by importance or date or literally anything but vibes and my motivation to do this.
i also have no credentials at all to do this ive been into this music for a year or something but i feel like im sufficiently well informed to explain some of it to friends

i try to refer to the date of production when possible, if artists arent listed in a crew or a set its probably because
they havent appeared anywhere else yet and i dont know them well enough to write much.

backlinks with the arrows are a little fucked due to how i automatically insert them idk
** Tracks
*** [[id:169c9c6a-17b0-42a8-8711-15f6d3aed821][Musical Mob]] - Pulse X (January 2002)
:PROPERTIES:
:ID:       45f6ceee-3145-42da-8afa-4aea5969e23d
:END:
:BACKLINKS:
[2024-02-21 Mi 13:37] <- [[id:f27014c2-4348-4ae3-85db-992f69d7ac38][Mystry - Pulse 8 (~2014)]]
[2024-02-21 Mi 13:32] <- [[id:7fb00a7e-678b-4567-a3c5-d6242f4e8031][Musical Mob - Pulse XYZ (~2003)]]
:END:
[[yt:4bMQTU2iI1E]]
Produced by [[id:6ce16e9c-9780-40ce-9911-4c0c700fb86f][Youngstar]], this is probably one of the most well-known and most important grime beats to ever
exist and for sure the most iconic [[id:80502fbb-07f8-4ef8-a180-3f717d0fd037][8-bar]] tune. Heavy bass, 5 minutes of pretty much the same 16-bars,
but people rinse it and the dozens of tracks it inspired (see backlinks). The kick drum/bass sound/whatever is
probably the most iconic bit of it all.
**** [[id:35137126-ceaf-41b4-9411-748c987fa834][Dizzee Rascal]] - Pulse X Dubplate
:PROPERTIES:
:ID:       6d767e0e-2ee8-470e-aca5-531a6d5e757c
:END:
[[yt:HX2pGg6606M]]
pure fire, the intro and first couple bars pop up in my head like twice a day
*** [[id:169c9c6a-17b0-42a8-8711-15f6d3aed821][Musical Mob ]]- Pulse XYZ (~2003)
:PROPERTIES:
:ID:       7fb00a7e-678b-4567-a3c5-d6242f4e8031
:END:
[[yt:cYijGpdqWzY]]
[[id:45f6ceee-3145-42da-8afa-4aea5969e23d][Pulse X]] edit with about 2 billion switch ups prod. [[id:6ce16e9c-9780-40ce-9911-4c0c700fb86f][Youngstar]]. Not my favorite one but its alright
*** [[id:f7f2d318-fb6a-458a-b69f-cd436435fd31][Mystry]] - Pulse 8 (~2014)
:PROPERTIES:
:ID:       f27014c2-4348-4ae3-85db-992f69d7ac38
:END:
[[yt:LVCUqd5izt8]]
One of the best somewhat more recent [[id:45f6ceee-3145-42da-8afa-4aea5969e23d][Pulse X]]-type riddims. The kick's there,, the "automatic" makes for a
great voice sample, the tonal bweeeh type bass every couple bars makes it singable too somehow.
**** [[id:0f87032e-78c4-4123-aa37-4fe7f1b0bd51][JME]] - Pulse 8 (2014)
:PROPERTIES:
:ID:       147b6914-bf44-4148-be37-8bcb0ceb9fdd
:END:
[[yt:ecgFjnPFnZQ]]
Slight variation of the beat I think, definitely one of the most fun tracks on the album. Lots of the
silliness [[id:0f87032e-78c4-4123-aa37-4fe7f1b0bd51][JME]] is known for, couple of great bars though.
*** [[id:38e88ed5-9248-47b1-8a07-96bd069a7aea][DJ Wonder]] - What (~2002)
:PROPERTIES:
:ID:       0fd18fe7-9f5c-4a38-b607-310097a60eb8
:END:
:BACKLINKS:
[2024-02-21 Mi 00:22] <- [[id:662407b5-6218-494f-bc5f-69c965dfc378][Wiley - Morgue (~2004?)]]
:END:
[[yt:bBiN5tQX7Ro]]
Absurd bass heavy weight
**** [[id:35137126-ceaf-41b4-9411-748c987fa834][Dizzee Rascal]] - Respect Me
*** [[id:6758cd23-96f2-4de5-9b48-7fbe270e76f2][Wiley]] - Morgue (~2004?)
:PROPERTIES:
:ID:       662407b5-6218-494f-bc5f-69c965dfc378
:END:
[[yt:z0cV9p2-VOg]]
obviously very much, uh, inspired by [[id:0fd18fe7-9f5c-4a38-b607-310097a60eb8][DJ Wonder - What (~2002)]], as far as i know thats related to some relationship
drama related to him and [[id:38e88ed5-9248-47b1-8a07-96bd069a7aea][DJ Wonder]], at least according to [[https://genius.com/Wiley-morgue-lyrics][Genius]] which also states it was banned from [[id:cecf3e92-5439-4892-ae83-5da3d7715e3a][rinse.fm]] due to that.
