grime.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>unis grime thign</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="grime_style.css" />


</head>
<body>
<div id="content" class="content">
<h1 class="title">unis grime thign</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb25bf2f">1. Grime Tunes</a>
<ul>
<li><a href="#org9e2d68e">1.1. Tracks</a>
<ul>
<li><a href="#orga7a9632">1.1.1. Musical Mob - Pulse X (January 2002)</a>
<ul>
<li><a href="#orgbfcc97d">1.1.1.1. Dizzee Rascal - Pulse X Dubplate</a></li>
</ul>
</li>
<li><a href="#orgd7ed4f8">1.1.2. Musical Mob - Pulse XYZ (~2003)</a></li>
<li><a href="#org29a1acf">1.1.3. Mystry - Pulse 8 (~2014)</a>
<ul>
<li><a href="#org5fec77d">1.1.3.1. JME - Pulse 8 (2014)</a></li>
</ul>
</li>
<li><a href="#orgeddd31d">1.1.4. DJ Wonder - What (~2002)</a>
<ul>
<li><a href="#org0ef8638">1.1.4.1. Dizzee Rascal - Respect Me</a></li>
</ul>
</li>
<li><a href="#orgb80be80">1.1.5. Wiley - Morgue (~2004?)</a>
<ul>
<li><a href="#org2955415">1.1.5.1. Roll Deep - Morgue</a></li>
</ul>
</li>
<li><a href="#org98e4c9f">1.1.6. Ruff Sqwad - Pied Piper</a></li>
<li><a href="#org59366d8">1.1.7. Ruff Sqwad - Together</a></li>
<li><a href="#orgaeaba14">1.1.8. Ruff Sqwad - Functions on the Low</a></li>
<li><a href="#org66197b1">1.1.9. Ruff Sqwad - Xtra (2004-2005)</a></li>
<li><a href="#org5bd5f36">1.1.10. Ruff Sqwad - Tings in Boots (2002-2003)</a>
<ul>
<li><a href="#orgb22977f">1.1.10.1. Ruff Sqwad - Tings in Boots (vocal ver) (2002-2003)</a></li>
</ul>
</li>
<li><a href="#org9932afb">1.1.11. Ruff Sqwad - Misty Cold (~2003)</a>
<ul>
<li><a href="#orgb2d8a0d">1.1.11.1. Ruff Sqwad - Misty Cold (XTC Remix) (~2003-2004)</a></li>
</ul>
</li>
<li><a href="#org6956b9e">1.1.12. Flirta D - Warp Speed (2004)</a></li>
<li><a href="#org3ddbe8e">1.1.13. Flirta D - Shottaz Riddim</a></li>
<li><a href="#org6967510">1.1.14. <span class="todo TODO">TODO</span> Coki &amp; Benga - Night</a></li>
<li><a href="#org143ef7d">1.1.15. Plastician - Shallow Grave (2004 Edit)</a></li>
<li><a href="#org496595f">1.1.16. Joker - Juggernaut (released 2024, made years before that idk)</a></li>
</ul>
</li>
<li><a href="#org10fc4be">1.2. Radio</a>
<ul>
<li><a href="#org009a001">1.2.1. Rinse.fm</a>
<ul>
<li><a href="#org5fa09fa">1.2.1.1. Wiley + Flowdan set (2001)</a></li>
<li><a href="#org1348c2b">1.2.1.2. Oblig with Big Zuu, Manga Saint Hilare, Flirta D, Sox, Jafro &amp; More (2024)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge08ea9c">1.3. Misc. Sets</a>
<ul>
<li><a href="#org7ec23b3">1.3.1. Neffa-T - Keep Hush Bristol: Dr. Dubplate&rsquo;s Birthday Bash (2022)</a></li>
</ul>
</li>
<li><a href="#org7e5dc6b">1.4. Artists</a>
<ul>
<li><a href="#orgc27b065">1.4.1. <span class="todo TODO">TODO</span> Wiley</a></li>
<li><a href="#org974b01f">1.4.2. <span class="todo TODO">TODO</span> DJ Wonder</a></li>
<li><a href="#orgd26e7e0">1.4.3. <span class="todo TODO">TODO</span> Flowdan</a></li>
<li><a href="#org2539096">1.4.4. <span class="todo TODO">TODO</span> Dizzee Rascal</a></li>
<li><a href="#orgd2b7db9">1.4.5. <span class="todo TODO">TODO</span> Slimzee</a></li>
<li><a href="#org51f438b">1.4.6. <span class="todo TODO">TODO</span> Youngstar</a></li>
<li><a href="#org045e90b">1.4.7. <span class="todo TODO">TODO</span> Mystry</a></li>
<li><a href="#orgf644721">1.4.8. <span class="todo TODO">TODO</span> JME</a></li>
<li><a href="#orgf7d9379">1.4.9. <span class="todo TODO">TODO</span> Rapid</a></li>
<li><a href="#org1f5171e">1.4.10. <span class="todo TODO">TODO</span> Slix</a></li>
<li><a href="#org09f817c">1.4.11. <span class="todo TODO">TODO</span> Tinchy Stryder</a></li>
<li><a href="#orgc0e965f">1.4.12. <span class="todo TODO">TODO</span> XTC</a></li>
<li><a href="#org76c1c9d">1.4.13. <span class="todo TODO">TODO</span> Flirta D</a></li>
<li><a href="#orga59b8a6">1.4.14. <span class="todo TODO">TODO</span> Jiggalo</a></li>
<li><a href="#org85c8cf8">1.4.15. <span class="todo TODO">TODO</span> Neffa-T</a></li>
<li><a href="#org02b4a0f">1.4.16. <span class="todo TODO">TODO</span> Plastician</a></li>
<li><a href="#orgf208a07">1.4.17. <span class="todo TODO">TODO</span> Oblig</a></li>
<li><a href="#org35d970c">1.4.18. <span class="todo TODO">TODO</span> Manga Saint Hilare</a></li>
<li><a href="#org22489a4">1.4.19. <span class="todo TODO">TODO</span> Joker</a></li>
</ul>
</li>
<li><a href="#org3116051">1.5. Albums etc.</a>
<ul>
<li><a href="#org6457111">1.5.1. Ruff Sqwad - White Label Classics</a></li>
</ul>
</li>
<li><a href="#orgd67243b">1.6. Crews</a>
<ul>
<li><a href="#org54f204f">1.6.1. <span class="todo TODO">TODO</span> Roll Deep</a></li>
<li><a href="#org73704b5">1.6.2. <span class="todo TODO">TODO</span> Musical Mob</a></li>
<li><a href="#orgcc4558c">1.6.3. <span class="todo TODO">TODO</span> Ruff Sqwad</a></li>
</ul>
</li>
<li><a href="#orgbd00146">1.7. Styles</a>
<ul>
<li><a href="#orgdac2716">1.7.1. <span class="todo TODO">TODO</span> 8-bar</a></li>
<li><a href="#org4da5b1c">1.7.2. <span class="todo TODO">TODO</span> Weightless</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb25bf2f" class="outline-2">
<h2 id="orgb25bf2f"><span class="section-number-2">1.</span> Grime Tunes</h2>
<div class="outline-text-2" id="text-1">
<p>
not ordered by importance or date or literally anything but vibes and my motivation to do this.
i also have no credentials at all to do this ive been into this music for a year or something but i feel like im sufficiently well informed to explain some of it to friends
</p>

<p>
i try to refer to the date of production when possible, if artists arent listed in a crew or a set its probably because
they havent appeared anywhere else yet and i dont know them well enough to write much.
</p>

<p>
backlinks with the arrows are a little fucked due to how i automatically insert them idk
</p>
</div>
<div id="outline-container-org9e2d68e" class="outline-3">
<h3 id="org9e2d68e"><span class="section-number-3">1.1.</span> Tracks</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orga7a9632" class="outline-4">
<h4 id="orga7a9632"><span class="section-number-4">1.1.1.</span> <a href="#org73704b5">Musical Mob</a> - Pulse X (January 2002)</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:37] </span></span> &lt;- <a href="#org29a1acf">Mystry - Pulse 8 (~2014)</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:32] </span></span> &lt;- <a href="#orgd7ed4f8">Musical Mob - Pulse XYZ (~2003)</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/4bMQTU2iI1E" frameborder="0" allowfullscreen></iframe></p>
Produced by <a href="#org51f438b">Youngstar</a>, this is probably one of the most well-known and most important grime beats to ever
exist and for sure the most iconic <a href="#orgdac2716">8-bar</a> tune. Heavy bass, 5 minutes of pretty much the same 16-bars,
but people rinse it and the dozens of tracks it inspired (see backlinks). The kick drum/bass sound/whatever is
probably the most iconic bit of it all.
</p>
</div>
<div id="outline-container-orgbfcc97d" class="outline-5">
<h5 id="orgbfcc97d"><span class="section-number-5">1.1.1.1.</span> <a href="#org2539096">Dizzee Rascal</a> - Pulse X Dubplate</h5>
<div class="outline-text-5" id="text-1-1-1-1">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/HX2pGg6606M" frameborder="0" allowfullscreen></iframe></p>
pure fire, the intro and first couple bars pop up in my head like twice a day
</p>
</div>
</div>
</div>
<div id="outline-container-orgd7ed4f8" class="outline-4">
<h4 id="orgd7ed4f8"><span class="section-number-4">1.1.2.</span> <a href="#org73704b5">Musical Mob </a>- Pulse XYZ (~2003)</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/cYijGpdqWzY" frameborder="0" allowfullscreen></iframe></p>
<a href="#orga7a9632">Pulse X</a> edit with about 2 billion switch ups prod. <a href="#org51f438b">Youngstar</a>. Not my favorite one but its alright
</p>
</div>
</div>
<div id="outline-container-org29a1acf" class="outline-4">
<h4 id="org29a1acf"><span class="section-number-4">1.1.3.</span> <a href="#org045e90b">Mystry</a> - Pulse 8 (~2014)</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/LVCUqd5izt8" frameborder="0" allowfullscreen></iframe></p>
One of the best somewhat more recent <a href="#orga7a9632">Pulse X</a>-type riddims. The kick&rsquo;s there,, the &ldquo;automatic&rdquo; makes for a
great voice sample, the tonal bweeeh type bass every couple bars makes it singable too somehow.
</p>
</div>
<div id="outline-container-org5fec77d" class="outline-5">
<h5 id="org5fec77d"><span class="section-number-5">1.1.3.1.</span> <a href="#orgf644721">JME</a> - Pulse 8 (2014)</h5>
<div class="outline-text-5" id="text-1-1-3-1">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/ecgFjnPFnZQ" frameborder="0" allowfullscreen></iframe></p>
Slight variation of the beat I think, definitely one of the most fun tracks on the album. Lots of the
silliness <a href="#orgf644721">JME</a> is known for, couple of great bars though.
</p>
</div>
</div>
</div>
<div id="outline-container-orgeddd31d" class="outline-4">
<h4 id="orgeddd31d"><span class="section-number-4">1.1.4.</span> <a href="#org974b01f">DJ Wonder</a> - What (~2002)</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 00:22] </span></span> &lt;- <a href="#orgb80be80">Wiley - Morgue (~2004?)</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/bBiN5tQX7Ro" frameborder="0" allowfullscreen></iframe></p>
Absurd bass heavy weight
</p>
</div>
<div id="outline-container-org0ef8638" class="outline-5">
<h5 id="org0ef8638"><span class="section-number-5">1.1.4.1.</span> <a href="#org2539096">Dizzee Rascal</a> - Respect Me</h5>
</div>
</div>
<div id="outline-container-orgb80be80" class="outline-4">
<h4 id="orgb80be80"><span class="section-number-4">1.1.5.</span> <a href="#orgc27b065">Wiley</a> - Morgue (~2004?)</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/z0cV9p2-VOg" frameborder="0" allowfullscreen></iframe></p>
obviously very much, uh, inspired by <a href="#orgeddd31d">DJ Wonder - What (~2002)</a>, as far as i know thats related to some relationship
drama related to him and <a href="#org974b01f">DJ Wonder</a>, at least according to <a href="https://genius.com/Wiley-morgue-lyrics">Genius</a> which also states it was banned from <a href="#org009a001">rinse.fm</a> due to that.
</p>
</div>
