grime.org
**** [[id:8026c704-3324-4ccf-afa8-ed49e789e6a1][Roll Deep]] - Morgue
:PROPERTIES:
:ID:       50249c49-f85c-400e-b420-cfbd6077f225
:END:
[[yt:kYWuhGG6QcQ]]
*** [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]] - Pied Piper
:PROPERTIES:
:ID:       ffe993e6-d8ae-4a0c-a0ae-f3e01b177be7
:END:
:BACKLINKS:
[2024-02-21 Mi 13:48] <- [[id:5fe29ba7-a76f-4345-924d-48c588c5ae6e][Ruff Sqwad - White Label Classics]]
:END:
[[yt:SDnOwNCrEu8]]
Great tune, love the blown out square lead and the eskibeat type beeps and boops. Prod. by [[id:dff70188-c585-4b0b-9010-1cdc16d854cd][Rapid]].

also this sells for almost triple digit prices, pretty absurd
*** [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]] - Together
:PROPERTIES:
:ID:       a86da663-a355-47fa-9330-3dbcb9c307e9
:END:
:BACKLINKS:
[2024-02-21 Mi 13:51] <- [[id:5fe29ba7-a76f-4345-924d-48c588c5ae6e][Ruff Sqwad - White Label Classics]]
:END:
[[yt:69reF45Ok_I]]
great guitar bit, choppy 2-step drums, thick square basses to complement it all
*** [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]] - Functions on the Low
:PROPERTIES:
:ID:       d2c64036-da6a-493e-8bda-20d27206780e
:END:
:BACKLINKS:
[2024-02-21 Mi 13:53] <- [[id:5fe29ba7-a76f-4345-924d-48c588c5ae6e][Ruff Sqwad - White Label Classics]]
:END:
[[yt:-uy0XIlnz4U]]
very close to just being cheesy with the chords and all that

part of the record [[id:3c90393f-e5e0-431a-a280-1a9124c9e785][Ruff Sqwad - Misty Cold (XTC Remix) (~2003-2004)]] is on
*** [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]] - Xtra (2004-2005)
:PROPERTIES:
:ID:       8b3c9363-7ab5-440a-a4ab-7ca446806203
:END:
:BACKLINKS:
[2024-02-21 Mi 13:58] <- [[id:5fe29ba7-a76f-4345-924d-48c588c5ae6e][Ruff Sqwad - White Label Classics]]
:END:
[[yt:-2dRMGVJwrg]]
Heavy one especially with these eight note cymbals and the ever present bassline
*** [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]] - Tings in Boots (2002-2003)
:PROPERTIES:
:ID:       15ebbd03-2d4d-4759-8f6f-1e1acf394871
:END:
:BACKLINKS:
[2024-02-21 Mi 14:03] <- [[id:5fe29ba7-a76f-4345-924d-48c588c5ae6e][Ruff Sqwad - White Label Classics]]
:END:
[[yt:ppR0lOC2rfU]]
first [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]] track as far I know. very raw and kind of carceral, great bassline but not their best
**** [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad -]] Tings in Boots (vocal ver) (2002-2003)
:PROPERTIES:
:ID:       20a31a00-54a2-4695-a17f-2184a307927f
:END:
[[yt:pMDHjMagG0Y]]
featurs (according to discogs at least) [[id:dff70188-c585-4b0b-9010-1cdc16d854cd][Rapid]], [[id:24be3842-8c5e-43ad-885e-83925646a5fa][Tinchy Stryder]], [[id:3ae5799d-c040-42c0-8749-eaa720b6b831][Slix]].
sadly not very good tbh, its also notable how young tinchy sounds despite being at least 16 or 17
*** [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad ]]- Misty Cold (~2003)
:PROPERTIES:
:ID:       ff56cbfe-87ea-4a8f-8e6b-e7856abc8116
:END:
[[yt:B8tMF191Fd0]]
alright one but also very well known for some reason
**** [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]] - Misty Cold ([[id:fba039e5-f752-4635-9c90-7771361485e6][XTC]] Remix) (~2003-2004)
:PROPERTIES:
:ID:       3c90393f-e5e0-431a-a280-1a9124c9e785
:END:
:BACKLINKS:
[2024-02-21 Mi 14:11] <- [[id:d2c64036-da6a-493e-8bda-20d27206780e][Ruff Sqwad - Functions on the Low]]
:END:
[[yt:3NLOA9bQbEc]]
outstandingly good, especially with that reversed and cut up sound every 2 bars. classic square bass
shines too

also one of the most expensive grime records, see https://www.discogs.com/release/1698948-XTC-Misty-Cold-Remix
*** [[id:1b9a8b0e-42fa-4044-a62e-f69038ba1a86][Flirta D]] - Warp Speed (2004)
:PROPERTIES:
:ID:       ba2b4c13-c11e-4501-8535-2958da840179
:END:
:BACKLINKS:
[2024-02-21 Mi 14:26] <- [[id:2b86fc13-143a-4620-a4ca-3fde9e1bb310][Flirta D - Shottaz Riddim]]
:END:
[[yt:ayME3Zy0vG8]]
prod. by [[id:c27f77cc-993d-4211-b801-e554c527d4b9][Jiggalo]].
definitely the most iconic flirta tune and a fun riddim too.
*** [[id:1b9a8b0e-42fa-4044-a62e-f69038ba1a86][Flirta D]] - Shottaz Riddim
:PROPERTIES:
:ID:       2b86fc13-143a-4620-a4ca-3fde9e1bb310
:END:
:BACKLINKS:
[2024-02-21 Mi 14:27] <- [[id:22fc4961-511e-44f7-9c52-e45665ed56f5][Neffa-T - Keep Hush Bristol: Dr. Dubplate's Birthday Bash (2022)]]
:END:
[[yt:vIcL1N5BdvE]]
prod. [[id:6ce16e9c-9780-40ce-9911-4c0c700fb86f][Youngstar]].
This was a dubplate until like 2012 when it got released on https://pitchcontrollerrecords.bandcamp.com/album/slk-the-lost-tapes-2.

feels like an early weightless tune given the lack of real drums and all the sfx, absolute banger
though. also has the characteristic youngstar bass, might be the best flirta track, bit more leftfield
than [[id:ba2b4c13-c11e-4501-8535-2958da840179][Warp Speed]] (especially due to flip. riddim. gymnastics).
*** TODO Coki & Benga - Night
:PROPERTIES:
:ID:       a31c6645-671f-49c7-8a41-9ff337b68e67
:END:
:BACKLINKS:
[2024-02-21 Mi 14:31] <- [[id:22fc4961-511e-44f7-9c52-e45665ed56f5][Neffa-T - Keep Hush Bristol: Dr. Dubplate's Birthday Bash (2022)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 14:31]
:END:
*** [[id:b4a11e57-425a-4850-8426-443a0ab0be39][Plastician]] - Shallow Grave (2004 Edit)
:PROPERTIES:
:ID:       942ea114-c758-4708-a4f9-1f08a870a4d8
:END:
:BACKLINKS:
[2024-02-21 Mi 22:30] <- [[id:475ff64d-7f36-4663-99ce-630f737cc0e1][Oblig with Big Zuu, Manga, Flirta D, Sox, Jafro & More (2024)]]
:END:
[[yt:TZ5ug15enjg]]

Deep and dark tune and definitely a classic. Somewhere on the edge between grime and dubstep like a lot of
the things Plastician made back in the day. [[https://twitter.com/Plastician/status/1755725501908304208][Interestingly]] it wasnt played out all that much around its release, more like a classic in hindsight.
*** [[id:1a5b02ed-7882-4238-9501-9c0233b7a247][Joker]] - Juggernaut (released 2024, made years before that idk)
:PROPERTIES:
:ID:       53d91147-92b4-4497-92b8-8e6232d8fd8f
:END:
:BACKLINKS:
[2024-02-21 Mi 22:46] <- [[id:475ff64d-7f36-4663-99ce-630f737cc0e1][Oblig with Big Zuu, Manga Saint Hilare, Flirta D, Sox, Jafro & More (2024)]]
:END:
https://soundcloud.com/jokerkapsize/juggernaut
More of a dubstep tune but its been used as a beat so it counts. great way for joker to return and amazing
example of his sound.
** Radio
