grime.html
<div id="outline-container-org2955415" class="outline-5">
<h5 id="org2955415"><span class="section-number-5">1.1.5.1.</span> <a href="#org54f204f">Roll Deep</a> - Morgue</h5>
<div class="outline-text-5" id="text-1-1-5-1">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/kYWuhGG6QcQ" frameborder="0" allowfullscreen></iframe></p>
</p>
</div>
</div>
</div>
<div id="outline-container-org98e4c9f" class="outline-4">
<h4 id="org98e4c9f"><span class="section-number-4">1.1.6.</span> <a href="#orgcc4558c">Ruff Sqwad</a> - Pied Piper</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:48] </span></span> &lt;- <a href="#org6457111">Ruff Sqwad - White Label Classics</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/SDnOwNCrEu8" frameborder="0" allowfullscreen></iframe></p>
Great tune, love the blown out square lead and the eskibeat type beeps and boops. Prod. by <a href="#orgf7d9379">Rapid</a>.
</p>

<p>
also this sells for almost triple digit prices, pretty absurd
</p>
</div>
</div>
<div id="outline-container-org59366d8" class="outline-4">
<h4 id="org59366d8"><span class="section-number-4">1.1.7.</span> <a href="#orgcc4558c">Ruff Sqwad</a> - Together</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:51] </span></span> &lt;- <a href="#org6457111">Ruff Sqwad - White Label Classics</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/69reF45Ok_I" frameborder="0" allowfullscreen></iframe></p>
great guitar bit, choppy 2-step drums, thick square basses to complement it all
</p>
</div>
</div>
<div id="outline-container-orgaeaba14" class="outline-4">
<h4 id="orgaeaba14"><span class="section-number-4">1.1.8.</span> <a href="#orgcc4558c">Ruff Sqwad</a> - Functions on the Low</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:53] </span></span> &lt;- <a href="#org6457111">Ruff Sqwad - White Label Classics</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/-uy0XIlnz4U" frameborder="0" allowfullscreen></iframe></p>
very close to just being cheesy with the chords and all that
</p>

<p>
part of the record <a href="#orgb2d8a0d">Ruff Sqwad - Misty Cold (XTC Remix) (~2003-2004)</a> is on
</p>
</div>
</div>
<div id="outline-container-org66197b1" class="outline-4">
<h4 id="org66197b1"><span class="section-number-4">1.1.9.</span> <a href="#orgcc4558c">Ruff Sqwad</a> - Xtra (2004-2005)</h4>
<div class="outline-text-4" id="text-1-1-9">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:58] </span></span> &lt;- <a href="#org6457111">Ruff Sqwad - White Label Classics</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/-2dRMGVJwrg" frameborder="0" allowfullscreen></iframe></p>
Heavy one especially with these eight note cymbals and the ever present bassline
</p>
</div>
</div>
<div id="outline-container-org5bd5f36" class="outline-4">
<h4 id="org5bd5f36"><span class="section-number-4">1.1.10.</span> <a href="#orgcc4558c">Ruff Sqwad</a> - Tings in Boots (2002-2003)</h4>
<div class="outline-text-4" id="text-1-1-10">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:03] </span></span> &lt;- <a href="#org6457111">Ruff Sqwad - White Label Classics</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/ppR0lOC2rfU" frameborder="0" allowfullscreen></iframe></p>
first <a href="#orgcc4558c">Ruff Sqwad</a> track as far I know. very raw and kind of carceral, great bassline but not their best
</p>
</div>
<div id="outline-container-orgb22977f" class="outline-5">
<h5 id="orgb22977f"><span class="section-number-5">1.1.10.1.</span> <a href="#orgcc4558c">Ruff Sqwad -</a> Tings in Boots (vocal ver) (2002-2003)</h5>
<div class="outline-text-5" id="text-1-1-10-1">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/pMDHjMagG0Y" frameborder="0" allowfullscreen></iframe></p>
featurs (according to discogs at least) <a href="#orgf7d9379">Rapid</a>, <a href="#org09f817c">Tinchy Stryder</a>, <a href="#org1f5171e">Slix</a>.
sadly not very good tbh, its also notable how young tinchy sounds despite being at least 16 or 17
</p>
</div>
</div>
</div>
<div id="outline-container-org9932afb" class="outline-4">
<h4 id="org9932afb"><span class="section-number-4">1.1.11.</span> <a href="#orgcc4558c">Ruff Sqwad </a>- Misty Cold (~2003)</h4>
<div class="outline-text-4" id="text-1-1-11">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/B8tMF191Fd0" frameborder="0" allowfullscreen></iframe></p>
alright one but also very well known for some reason
</p>
</div>
<div id="outline-container-orgb2d8a0d" class="outline-5">
<h5 id="orgb2d8a0d"><span class="section-number-5">1.1.11.1.</span> <a href="#orgcc4558c">Ruff Sqwad</a> - Misty Cold (<a href="#orgc0e965f">XTC</a> Remix) (~2003-2004)</h5>
<div class="outline-text-5" id="text-1-1-11-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:11] </span></span> &lt;- <a href="#orgaeaba14">Ruff Sqwad - Functions on the Low</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/3NLOA9bQbEc" frameborder="0" allowfullscreen></iframe></p>
outstandingly good, especially with that reversed and cut up sound every 2 bars. classic square bass
shines too
</p>

<p>
also one of the most expensive grime records, see <a href="https://www.discogs.com/release/1698948-XTC-Misty-Cold-Remix">https://www.discogs.com/release/1698948-XTC-Misty-Cold-Remix</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org6956b9e" class="outline-4">
<h4 id="org6956b9e"><span class="section-number-4">1.1.12.</span> <a href="#org76c1c9d">Flirta D</a> - Warp Speed (2004)</h4>
<div class="outline-text-4" id="text-1-1-12">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:26] </span></span> &lt;- <a href="#org3ddbe8e">Flirta D - Shottaz Riddim</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/ayME3Zy0vG8" frameborder="0" allowfullscreen></iframe></p>
prod. by <a href="#orga59b8a6">Jiggalo</a>.
definitely the most iconic flirta tune and a fun riddim too.
</p>
</div>
</div>
<div id="outline-container-org3ddbe8e" class="outline-4">
<h4 id="org3ddbe8e"><span class="section-number-4">1.1.13.</span> <a href="#org76c1c9d">Flirta D</a> - Shottaz Riddim</h4>
<div class="outline-text-4" id="text-1-1-13">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:27] </span></span> &lt;- <a href="#org7ec23b3">Neffa-T - Keep Hush Bristol: Dr. Dubplate&rsquo;s Birthday Bash (2022)</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/vIcL1N5BdvE" frameborder="0" allowfullscreen></iframe></p>
prod. <a href="#org51f438b">Youngstar</a>.
This was a dubplate until like 2012 when it got released on <a href="https://pitchcontrollerrecords.bandcamp.com/album/slk-the-lost-tapes-2">https://pitchcontrollerrecords.bandcamp.com/album/slk-the-lost-tapes-2</a>.
</p>

<p>
feels like an early weightless tune given the lack of real drums and all the sfx, absolute banger
though. also has the characteristic youngstar bass, might be the best flirta track, bit more leftfield
than <a href="#org6956b9e">Warp Speed</a> (especially due to flip. riddim. gymnastics).
</p>
</div>
</div>
<div id="outline-container-org6967510" class="outline-4">
<h4 id="org6967510"><span class="section-number-4">1.1.14.</span> <span class="todo TODO">TODO</span> Coki &amp; Benga - Night</h4>
<div class="outline-text-4" id="text-1-1-14">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:31] </span></span> &lt;- <a href="#org7ec23b3">Neffa-T - Keep Hush Bristol: Dr. Dubplate&rsquo;s Birthday Bash (2022)</a>
</p>
</div>
</div>
<div id="outline-container-org143ef7d" class="outline-4">
<h4 id="org143ef7d"><span class="section-number-4">1.1.15.</span> <a href="#org02b4a0f">Plastician</a> - Shallow Grave (2004 Edit)</h4>
<div class="outline-text-4" id="text-1-1-15">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 22:30] </span></span> &lt;- <a href="#org1348c2b">Oblig with Big Zuu, Manga, Flirta D, Sox, Jafro &amp; More (2024)</a>
</p>
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/TZ5ug15enjg" frameborder="0" allowfullscreen></iframe></p>
</p>

<p>
Deep and dark tune and definitely a classic. Somewhere on the edge between grime and dubstep like a lot of
the things Plastician made back in the day. <a href="https://twitter.com/Plastician/status/1755725501908304208">Interestingly</a> it wasnt played out all that much around its release, more like a classic in hindsight.
</p>
</div>
</div>
<div id="outline-container-org496595f" class="outline-4">
<h4 id="org496595f"><span class="section-number-4">1.1.16.</span> <a href="#org22489a4">Joker</a> - Juggernaut (released 2024, made years before that idk)</h4>
<div class="outline-text-4" id="text-1-1-16">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 22:46] </span></span> &lt;- <a href="#org1348c2b">Oblig with Big Zuu, Manga Saint Hilare, Flirta D, Sox, Jafro &amp; More (2024)</a>
</p>
<p>
<a href="https://soundcloud.com/jokerkapsize/juggernaut">https://soundcloud.com/jokerkapsize/juggernaut</a>
More of a dubstep tune but its been used as a beat so it counts. great way for joker to return and amazing
example of his sound.
</p>
</div>
</div>
</div>
