grime.org
*** Rinse.fm
:PROPERTIES:
:ID:       cecf3e92-5439-4892-ae83-5da3d7715e3a
:END:
still around on [[https://rinse.fm/]]! established as a jungle pirate radio by [[id:3f7813d5-5bfc-4b3d-b988-285650ef98eb][Slimzee]] around 95 and helped push garage, grime and dubstep
**** [[id:6758cd23-96f2-4de5-9b48-7fbe270e76f2][Wiley]] + [[id:d08bf74c-93bc-4cf7-ad7e-6db66f58d409][Flowdan]] set (2001)
:PROPERTIES:
:ID:       a8b9226a-8f9b-49e9-be01-65a44d746087
:END:
[[yt:V4jWCe73Pv8]]
kind of low quality and not the very best mc work of those two but some crazy garage and 2-step tunes in particular
**** [[id:e4ae951e-aff6-4da8-a9f4-5aee31903621][Oblig]] with Big Zuu, [[id:c4029910-ba36-4700-8ca8-0758764f5bb8][Manga Saint Hilare]], [[id:1b9a8b0e-42fa-4044-a62e-f69038ba1a86][Flirta D]], Sox, Jafro & More (2024)
:PROPERTIES:
:ID:       475ff64d-7f36-4663-99ce-630f737cc0e1
:END:
[[yt:T5AETXnQD6o]]
- crazy [[id:942ea114-c758-4708-a4f9-1f08a870a4d8][Shallow Grave]] around 8:20
- [[id:53d91147-92b4-4497-92b8-8e6232d8fd8f][Juggernaut]] around 13:00 pops off too
** Misc. Sets
*** [[id:0bfa500b-a50a-408c-92a1-b3b2a7abab48][Neffa-T]] - Keep Hush Bristol: Dr. Dubplate's Birthday Bash (2022)
:PROPERTIES:
:ID:       22fc4961-511e-44f7-9c52-e45665ed56f5
:END:
[[yt:-ZNQmjfhYF0]]
absurd opening. Guy got [[id:2b86fc13-143a-4620-a4ca-3fde9e1bb310][Shottaz Riddim]] at like 160 bpm mixed into [[yt:uubDhcd6Ty0][this]] banger [[id:a31c6645-671f-49c7-8a41-9ff337b68e67][Night]] remix back into [[yt:sOQA6oli2jc][the Body Groove]] instrumental
** Artists
*** TODO Wiley
:PROPERTIES:
:ID:       6758cd23-96f2-4de5-9b48-7fbe270e76f2
:END:
:BACKLINKS:
[2024-02-21 Mi 00:34] <- [[id:a8b9226a-8f9b-49e9-be01-65a44d746087][+ Flowdan set (2001)]]
[2024-02-21 Mi 00:33] <- [[id:662407b5-6218-494f-bc5f-69c965dfc378][- Morgue (~2004?)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 00:32]
:END:
*** TODO DJ Wonder
:PROPERTIES:
:ID:       38e88ed5-9248-47b1-8a07-96bd069a7aea
:END:
:BACKLINKS:
[2024-02-21 Mi 00:34] <- [[id:662407b5-6218-494f-bc5f-69c965dfc378][Wiley - Morgue (~2004?)]]
[2024-02-21 Mi 00:33] <- [[id:0fd18fe7-9f5c-4a38-b607-310097a60eb8][DJ Wonder - What (~2002)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 00:32]
:END:
*** TODO Flowdan
:PROPERTIES:
:ID:       d08bf74c-93bc-4cf7-ad7e-6db66f58d409
:END:
:BACKLINKS:
[2024-02-21 Mi 00:34] <- [[id:a8b9226a-8f9b-49e9-be01-65a44d746087][Wiley +  set (2001)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 00:32]
:END:
*** TODO Dizzee Rascal
:PROPERTIES:
:ID:       35137126-ceaf-41b4-9411-748c987fa834
:END:
:BACKLINKS:
[2024-02-21 Mi 13:27] <- [[id:6d767e0e-2ee8-470e-aca5-531a6d5e757c][Pulse X Dubplate]]
[2024-02-21 Mi 00:33] <- [[id:0fd18fe7-9f5c-4a38-b607-310097a60eb8][DJ Wonder - What (~2002)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 00:33]
:END:
*** TODO Slimzee
:PROPERTIES:
:ID:       3f7813d5-5bfc-4b3d-b988-285650ef98eb
:END:
:BACKLINKS:
[2024-02-21 Mi 00:34] <- [[id:cecf3e92-5439-4892-ae83-5da3d7715e3a][Rinse.fm]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 00:34]
:END:
*** TODO Youngstar
:PROPERTIES:
:ID:       6ce16e9c-9780-40ce-9911-4c0c700fb86f
:END:
:BACKLINKS:
[2024-02-21 Mi 14:23] <- [[id:2b86fc13-143a-4620-a4ca-3fde9e1bb310][Flirta D - Shottaz Riddim]]
[2024-02-21 Mi 13:34] <- [[id:7fb00a7e-678b-4567-a3c5-d6242f4e8031][Musical Mob - Pulse XYZ (~2003)]]
[2024-02-21 Mi 13:24] <- [[id:45f6ceee-3145-42da-8afa-4aea5969e23d][Musical Mob - Pulse X (January 2002)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 13:24]
:END:
*** TODO Mystry
:PROPERTIES:
:ID:       f7f2d318-fb6a-458a-b69f-cd436435fd31
:END:
:BACKLINKS:
[2024-02-21 Mi 13:36] <- [[id:f27014c2-4348-4ae3-85db-992f69d7ac38][Pulse 8 (~2014)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 13:35]
:END:
Grime and somehow also riddim dubstep producer
*** TODO JME
:PROPERTIES:
:ID:       0f87032e-78c4-4123-aa37-4fe7f1b0bd51
:END:
:BACKLINKS:
[2024-02-21 Mi 13:41] <- [[id:147b6914-bf44-4148-be37-8bcb0ceb9fdd][JME - Pulse 8 (2014)]]
[2024-02-21 Mi 13:39] <- [[id:147b6914-bf44-4148-be37-8bcb0ceb9fdd][- Pulse 8 (2014)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 13:39]
:END:
*** TODO Rapid
:PROPERTIES:
:ID:       dff70188-c585-4b0b-9010-1cdc16d854cd
:END:
:BACKLINKS:
[2024-02-21 Mi 14:05] <- [[id:20a31a00-54a2-4695-a17f-2184a307927f][Ruff Sqwad - Tings in Boots (vocal ver)]]
[2024-02-21 Mi 13:47] <- [[id:ffe993e6-d8ae-4a0c-a0ae-f3e01b177be7][Ruff Sqwad - Pied Piper]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 13:47]
:END:
Member of [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]]
*** TODO Slix
:PROPERTIES:
:ID:       3ae5799d-c040-42c0-8749-eaa720b6b831
:END:
:BACKLINKS:
[2024-02-21 Mi 14:05] <- [[id:20a31a00-54a2-4695-a17f-2184a307927f][Ruff Sqwad - Tings in Boots (vocal ver)]]
:END:
:LOGBOOK:

- State "TODO"       from              [2024-02-21 Mi 14:04]
:END:
Member of [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]]
*** TODO Tinchy Stryder
:PROPERTIES:
:ID:       24be3842-8c5e-43ad-885e-83925646a5fa
:END:
:BACKLINKS:
[2024-02-21 Mi 14:05] <- [[id:20a31a00-54a2-4695-a17f-2184a307927f][Ruff Sqwad - Tings in Boots (vocal ver)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 14:04]
:END:
Member of [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]]
*** TODO XTC
:PROPERTIES:
:ID:       fba039e5-f752-4635-9c90-7771361485e6
:END:
:BACKLINKS:
[2024-02-21 Mi 14:10] <- [[id:3c90393f-e5e0-431a-a280-1a9124c9e785][Ruff Sqwad - Misty Cold (]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 14:08]
:END:
