grime.html
<div id="outline-container-org10fc4be" class="outline-3">
<h3 id="org10fc4be"><span class="section-number-3">1.2.</span> Radio</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org009a001" class="outline-4">
<h4 id="org009a001"><span class="section-number-4">1.2.1.</span> Rinse.fm</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
still around on <a href="https://rinse.fm/">https://rinse.fm/</a>! established as a jungle pirate radio by <a href="#orgd2b7db9">Slimzee</a> around 95 and helped push garage, grime and dubstep
</p>
</div>
<div id="outline-container-org5fa09fa" class="outline-5">
<h5 id="org5fa09fa"><span class="section-number-5">1.2.1.1.</span> <a href="#orgc27b065">Wiley</a> + <a href="#orgd26e7e0">Flowdan</a> set (2001)</h5>
<div class="outline-text-5" id="text-1-2-1-1">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/V4jWCe73Pv8" frameborder="0" allowfullscreen></iframe></p>
kind of low quality and not the very best mc work of those two but some crazy garage and 2-step tunes in particular
</p>
</div>
</div>
<div id="outline-container-org1348c2b" class="outline-5">
<h5 id="org1348c2b"><span class="section-number-5">1.2.1.2.</span> <a href="#orgf208a07">Oblig</a> with Big Zuu, <a href="#org35d970c">Manga Saint Hilare</a>, <a href="#org76c1c9d">Flirta D</a>, Sox, Jafro &amp; More (2024)</h5>
<div class="outline-text-5" id="text-1-2-1-2">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/T5AETXnQD6o" frameborder="0" allowfullscreen></iframe></p>
</p>
<ul class="org-ul">
<li>crazy <a href="#org143ef7d">Shallow Grave</a> around 8:20</li>
<li><a href="#org496595f">Juggernaut</a> around 13:00 pops off too</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orge08ea9c" class="outline-3">
<h3 id="orge08ea9c"><span class="section-number-3">1.3.</span> Misc. Sets</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org7ec23b3" class="outline-4">
<h4 id="org7ec23b3"><span class="section-number-4">1.3.1.</span> <a href="#org85c8cf8">Neffa-T</a> - Keep Hush Bristol: Dr. Dubplate&rsquo;s Birthday Bash (2022)</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/-ZNQmjfhYF0" frameborder="0" allowfullscreen></iframe></p>
absurd opening. Guy got <a href="#org3ddbe8e">Shottaz Riddim</a> at like 160 bpm mixed into <p><iframe width="440" height="335" src="https://www.youtube.com/embed/uubDhcd6Ty0" frameborder="0" allowfullscreen>this</iframe></p> banger <a href="#org6967510">Night</a> remix back into <p><iframe width="440" height="335" src="https://www.youtube.com/embed/sOQA6oli2jc" frameborder="0" allowfullscreen>the Body Groove</iframe></p> instrumental
</p>
</div>
</div>
</div>
<div id="outline-container-org7e5dc6b" class="outline-3">
<h3 id="org7e5dc6b"><span class="section-number-3">1.4.</span> Artists</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgc27b065" class="outline-4">
<h4 id="orgc27b065"><span class="section-number-4">1.4.1.</span> <span class="todo TODO">TODO</span> Wiley</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 00:34] </span></span> &lt;- <a href="#org5fa09fa">+ Flowdan set (2001)</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 00:33] </span></span> &lt;- <a href="#orgb80be80">- Morgue (~2004?)</a>
</p>
</div>
</div>
<div id="outline-container-org974b01f" class="outline-4">
<h4 id="org974b01f"><span class="section-number-4">1.4.2.</span> <span class="todo TODO">TODO</span> DJ Wonder</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 00:34] </span></span> &lt;- <a href="#orgb80be80">Wiley - Morgue (~2004?)</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 00:33] </span></span> &lt;- <a href="#orgeddd31d">DJ Wonder - What (~2002)</a>
</p>
</div>
</div>
<div id="outline-container-orgd26e7e0" class="outline-4">
<h4 id="orgd26e7e0"><span class="section-number-4">1.4.3.</span> <span class="todo TODO">TODO</span> Flowdan</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 00:34] </span></span> &lt;- <a href="#org5fa09fa">Wiley +  set (2001)</a>
</p>
</div>
</div>
<div id="outline-container-org2539096" class="outline-4">
<h4 id="org2539096"><span class="section-number-4">1.4.4.</span> <span class="todo TODO">TODO</span> Dizzee Rascal</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:27] </span></span> &lt;- <a href="#orgbfcc97d">Pulse X Dubplate</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 00:33] </span></span> &lt;- <a href="#orgeddd31d">DJ Wonder - What (~2002)</a>
</p>
</div>
</div>
<div id="outline-container-orgd2b7db9" class="outline-4">
<h4 id="orgd2b7db9"><span class="section-number-4">1.4.5.</span> <span class="todo TODO">TODO</span> Slimzee</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 00:34] </span></span> &lt;- <a href="#org009a001">Rinse.fm</a>
</p>
</div>
</div>
<div id="outline-container-org51f438b" class="outline-4">
<h4 id="org51f438b"><span class="section-number-4">1.4.6.</span> <span class="todo TODO">TODO</span> Youngstar</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:23] </span></span> &lt;- <a href="#org3ddbe8e">Flirta D - Shottaz Riddim</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:34] </span></span> &lt;- <a href="#orgd7ed4f8">Musical Mob - Pulse XYZ (~2003)</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:24] </span></span> &lt;- <a href="#orga7a9632">Musical Mob - Pulse X (January 2002)</a>
</p>
</div>
</div>
<div id="outline-container-org045e90b" class="outline-4">
<h4 id="org045e90b"><span class="section-number-4">1.4.7.</span> <span class="todo TODO">TODO</span> Mystry</h4>
<div class="outline-text-4" id="text-1-4-7">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:36] </span></span> &lt;- <a href="#org29a1acf">Pulse 8 (~2014)</a>
</p>
<p>
Grime and somehow also riddim dubstep producer
</p>
</div>
</div>
<div id="outline-container-orgf644721" class="outline-4">
<h4 id="orgf644721"><span class="section-number-4">1.4.8.</span> <span class="todo TODO">TODO</span> JME</h4>
<div class="outline-text-4" id="text-1-4-8">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:41] </span></span> &lt;- <a href="#org5fec77d">JME - Pulse 8 (2014)</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:39] </span></span> &lt;- <a href="#org5fec77d">- Pulse 8 (2014)</a>
</p>
</div>
</div>
<div id="outline-container-orgf7d9379" class="outline-4">
<h4 id="orgf7d9379"><span class="section-number-4">1.4.9.</span> <span class="todo TODO">TODO</span> Rapid</h4>
<div class="outline-text-4" id="text-1-4-9">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:05] </span></span> &lt;- <a href="#orgb22977f">Ruff Sqwad - Tings in Boots (vocal ver)</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:47] </span></span> &lt;- <a href="#org98e4c9f">Ruff Sqwad - Pied Piper</a>
</p>
<p>
Member of <a href="#orgcc4558c">Ruff Sqwad</a>
</p>
</div>
</div>
<div id="outline-container-org1f5171e" class="outline-4">
<h4 id="org1f5171e"><span class="section-number-4">1.4.10.</span> <span class="todo TODO">TODO</span> Slix</h4>
<div class="outline-text-4" id="text-1-4-10">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:05] </span></span> &lt;- <a href="#orgb22977f">Ruff Sqwad - Tings in Boots (vocal ver)</a>
</p>
<p>
Member of <a href="#orgcc4558c">Ruff Sqwad</a>
</p>
</div>
</div>
<div id="outline-container-org09f817c" class="outline-4">
<h4 id="org09f817c"><span class="section-number-4">1.4.11.</span> <span class="todo TODO">TODO</span> Tinchy Stryder</h4>
<div class="outline-text-4" id="text-1-4-11">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:05] </span></span> &lt;- <a href="#orgb22977f">Ruff Sqwad - Tings in Boots (vocal ver)</a>
</p>
<p>
Member of <a href="#orgcc4558c">Ruff Sqwad</a>
</p>
</div>
</div>
