grime.org
*** TODO Flirta D
:PROPERTIES:
:ID:       1b9a8b0e-42fa-4044-a62e-f69038ba1a86
:END:
:BACKLINKS:
[2024-02-21 Mi 22:29] <- [[id:475ff64d-7f36-4663-99ce-630f737cc0e1][Oblig with Big Zuu, Manga, Flirta D, Sox, Jafro & More (2024)]]
[2024-02-21 Mi 14:23] <- [[id:2b86fc13-143a-4620-a4ca-3fde9e1bb310][- Shottaz Riddim]]
[2024-02-21 Mi 14:16] <- [[id:ba2b4c13-c11e-4501-8535-2958da840179][- Warp Speed (2004)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 14:14]
:END:
probably one of the most underrated MCs in grime. absolutely wild what this man can do in a single take,
from ad libs to the backwards flow to the characteristic f to the l i thing and so on. not the best
lyrically but definitely one of the most creative and technically impressive MCs
*** TODO Jiggalo
:PROPERTIES:
:ID:       c27f77cc-993d-4211-b801-e554c527d4b9
:END:
:BACKLINKS:
[2024-02-21 Mi 14:17] <- [[id:ba2b4c13-c11e-4501-8535-2958da840179][Flirta D - Warp Speed (2004)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 14:16]
:END:
*** TODO Neffa-T
:PROPERTIES:
:ID:       0bfa500b-a50a-408c-92a1-b3b2a7abab48
:END:
:BACKLINKS:
[2024-02-21 Mi 14:21] <- [[id:22fc4961-511e-44f7-9c52-e45665ed56f5][- Keep Hush Bristol: Dr. Dubplate's Birthday Bash]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 14:19]
:END:
techno, grime and dubstep DJ from bristol, one of the most technically well-versed djs not only in the genre but probably in all of bass music
*** TODO Plastician
:PROPERTIES:
:ID:       b4a11e57-425a-4850-8426-443a0ab0be39
:END:
:BACKLINKS:
[2024-02-21 Mi 22:23] <- [[id:942ea114-c758-4708-a4f9-1f08a870a4d8][- Shallow Grave (2004 Edit)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 22:22]
:END:
FKA Plasticman, had to change names due to trademark issues. Very influential guy in grime, dubstep and wave (a decade later!).
*** TODO Oblig
:PROPERTIES:
:ID:       e4ae951e-aff6-4da8-a9f4-5aee31903621
:END:
:BACKLINKS:
[2024-02-21 Mi 22:29] <- [[id:475ff64d-7f36-4663-99ce-630f737cc0e1][with Big Zuu, Manga, Flirta D, Sox, Jafro & More (2024)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 22:29]
:END:
*** TODO Manga Saint Hilare
:PROPERTIES:
:ID:       c4029910-ba36-4700-8ca8-0758764f5bb8
:END:
:BACKLINKS:
[2024-02-21 Mi 22:34] <- [[id:475ff64d-7f36-4663-99ce-630f737cc0e1][Oblig with Big Zuu, , Flirta D, Sox, Jafro & More (2024)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 22:33]
:END:
*** TODO Joker
:PROPERTIES:
:ID:       1a5b02ed-7882-4238-9501-9c0233b7a247
:END:
:BACKLINKS:
[2024-02-21 Mi 22:45] <- [[id:53d91147-92b4-4497-92b8-8e6232d8fd8f][Joker - Juggernaut]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 22:44]
:END:
One of the dubstep goats for sure
** Albums etc.
*** [[id:17fa50df-855c-4f29-ae5d-cfe318908dec][Ruff Sqwad]] - White Label Classics
:PROPERTIES:
:ID:       5fe29ba7-a76f-4345-924d-48c588c5ae6e
:END:
[[yt:JI501loMDjE&list=OLAK5uy_mC776hXD43TTbvSjDTB9K9fGytbwVVsCk]]
Lots of classic instrumentals, imo chill and almost melancholic vibes compared to the cold eskibeat sounds
for example, but there's lots of overlap too with tunes like [[id:ffe993e6-d8ae-4a0c-a0ae-f3e01b177be7][Ruff Sqwad - Pied Piper]].
Also included:
- [[id:a86da663-a355-47fa-9330-3dbcb9c307e9][Ruff Sqwad - Together]]
- [[id:d2c64036-da6a-493e-8bda-20d27206780e][Ruff Sqwad - Functions on the Low]]
- [[id:8b3c9363-7ab5-440a-a4ab-7ca446806203][Ruff Sqwad - Xtra]]
- [[id:15ebbd03-2d4d-4759-8f6f-1e1acf394871][Ruff Sqwad - Tings in Boots]]

** Crews
*** TODO Roll Deep
:PROPERTIES:
:ID:       8026c704-3324-4ccf-afa8-ed49e789e6a1
:END:
:BACKLINKS:
[2024-02-21 Mi 00:35] <- [[id:50249c49-f85c-400e-b420-cfbd6077f225][- Morgue]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 00:32]
:END:
*** TODO Musical Mob
:PROPERTIES:
:ID:       169c9c6a-17b0-42a8-8711-15f6d3aed821
:END:
:BACKLINKS:
[2024-02-21 Mi 13:32] <- [[id:7fb00a7e-678b-4567-a3c5-d6242f4e8031][- Pulse XYZ]]
[2024-02-21 Mi 13:21] <- [[id:45f6ceee-3145-42da-8afa-4aea5969e23d][Musical Mob - Pulse X]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 13:20]
:END:
*** TODO Ruff Sqwad
:PROPERTIES:
:ID:       17fa50df-855c-4f29-ae5d-cfe318908dec
:END:
:BACKLINKS:
[2024-02-21 Mi 14:10] <- [[id:3c90393f-e5e0-431a-a280-1a9124c9e785][Misty Cold]]
[2024-02-21 Mi 14:09] <- [[id:ff56cbfe-87ea-4a8f-8e6b-e7856abc8116][- Misty Cold (~2003)]]
[2024-02-21 Mi 14:05] <- [[id:24be3842-8c5e-43ad-885e-83925646a5fa][Tinchy Stryder]]
[2024-02-21 Mi 14:05] <- [[id:3ae5799d-c040-42c0-8749-eaa720b6b831][Slix]]
[2024-02-21 Mi 14:04] <- [[id:20a31a00-54a2-4695-a17f-2184a307927f][Tings in Boots (vocal ver)]]
[2024-02-21 Mi 14:02] <- [[id:15ebbd03-2d4d-4759-8f6f-1e1acf394871][Ruff Sqwad - Tings in Boots]]
[2024-02-21 Mi 14:02] <- [[id:15ebbd03-2d4d-4759-8f6f-1e1acf394871][- Tings in Boots]]
[2024-02-21 Mi 13:55] <- [[id:8b3c9363-7ab5-440a-a4ab-7ca446806203][- Xtra]]
[2024-02-21 Mi 13:51] <- [[id:d2c64036-da6a-493e-8bda-20d27206780e][- Functions on the Low]]
[2024-02-21 Mi 13:49] <- [[id:a86da663-a355-47fa-9330-3dbcb9c307e9][- Together]]
[2024-02-21 Mi 13:48] <- [[id:dff70188-c585-4b0b-9010-1cdc16d854cd][Rapid]]
[2024-02-21 Mi 13:46] <- [[id:ffe993e6-d8ae-4a0c-a0ae-f3e01b177be7][- Pied Piper]]
[2024-02-21 Mi 13:44] <- [[id:5fe29ba7-a76f-4345-924d-48c588c5ae6e][White Label Classics]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 13:42]
:END:
Formed around 2001, pretty influential instrumentals.
** Styles
*** TODO 8-bar
:PROPERTIES:
:ID:       80502fbb-07f8-4ef8-a180-3f717d0fd037
:END:
:BACKLINKS:
[2024-02-21 Mi 13:25] <- [[id:45f6ceee-3145-42da-8afa-4aea5969e23d][Musical Mob - Pulse X (January 2002)]]
:END:
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 13:25]
:END:
Early 2000s style from the transitionary period between garage and grime.
Named after its A/B structure with each part 8 bars long which lended itself very well to fast-paced MCing in larger crews with 8 or 16-bar verses for each member.
*** TODO Weightless
:LOGBOOK:
- State "TODO"       from              [2024-02-21 Mi 14:27]
:END:
