grime.html
<div id="outline-container-orgc0e965f" class="outline-4">
<h4 id="orgc0e965f"><span class="section-number-4">1.4.12.</span> <span class="todo TODO">TODO</span> XTC</h4>
<div class="outline-text-4" id="text-1-4-12">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:10] </span></span> &lt;- <a href="#orgb2d8a0d">Ruff Sqwad - Misty Cold (</a>
</p>
</div>
</div>
<div id="outline-container-org76c1c9d" class="outline-4">
<h4 id="org76c1c9d"><span class="section-number-4">1.4.13.</span> <span class="todo TODO">TODO</span> Flirta D</h4>
<div class="outline-text-4" id="text-1-4-13">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 22:29] </span></span> &lt;- <a href="#org1348c2b">Oblig with Big Zuu, Manga, Flirta D, Sox, Jafro &amp; More (2024)</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:23] </span></span> &lt;- <a href="#org3ddbe8e">- Shottaz Riddim</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:16] </span></span> &lt;- <a href="#org6956b9e">- Warp Speed (2004)</a>
</p>
<p>
probably one of the most underrated MCs in grime. absolutely wild what this man can do in a single take,
from ad libs to the backwards flow to the characteristic f to the l i thing and so on. not the best
lyrically but definitely one of the most creative and technically impressive MCs
</p>
</div>
</div>
<div id="outline-container-orga59b8a6" class="outline-4">
<h4 id="orga59b8a6"><span class="section-number-4">1.4.14.</span> <span class="todo TODO">TODO</span> Jiggalo</h4>
<div class="outline-text-4" id="text-1-4-14">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:17] </span></span> &lt;- <a href="#org6956b9e">Flirta D - Warp Speed (2004)</a>
</p>
</div>
</div>
<div id="outline-container-org85c8cf8" class="outline-4">
<h4 id="org85c8cf8"><span class="section-number-4">1.4.15.</span> <span class="todo TODO">TODO</span> Neffa-T</h4>
<div class="outline-text-4" id="text-1-4-15">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:21] </span></span> &lt;- <a href="#org7ec23b3">- Keep Hush Bristol: Dr. Dubplate&rsquo;s Birthday Bash</a>
</p>
<p>
techno, grime and dubstep DJ from bristol, one of the most technically well-versed djs not only in the genre but probably in all of bass music
</p>
</div>
</div>
<div id="outline-container-org02b4a0f" class="outline-4">
<h4 id="org02b4a0f"><span class="section-number-4">1.4.16.</span> <span class="todo TODO">TODO</span> Plastician</h4>
<div class="outline-text-4" id="text-1-4-16">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 22:23] </span></span> &lt;- <a href="#org143ef7d">- Shallow Grave (2004 Edit)</a>
</p>
<p>
FKA Plasticman, had to change names due to trademark issues. Very influential guy in grime, dubstep and wave (a decade later!).
</p>
</div>
</div>
<div id="outline-container-orgf208a07" class="outline-4">
<h4 id="orgf208a07"><span class="section-number-4">1.4.17.</span> <span class="todo TODO">TODO</span> Oblig</h4>
<div class="outline-text-4" id="text-1-4-17">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 22:29] </span></span> &lt;- <a href="#org1348c2b">with Big Zuu, Manga, Flirta D, Sox, Jafro &amp; More (2024)</a>
</p>
</div>
</div>
<div id="outline-container-org35d970c" class="outline-4">
<h4 id="org35d970c"><span class="section-number-4">1.4.18.</span> <span class="todo TODO">TODO</span> Manga Saint Hilare</h4>
<div class="outline-text-4" id="text-1-4-18">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 22:34] </span></span> &lt;- <a href="#org1348c2b">Oblig with Big Zuu, , Flirta D, Sox, Jafro &amp; More (2024)</a>
</p>
</div>
</div>
<div id="outline-container-org22489a4" class="outline-4">
<h4 id="org22489a4"><span class="section-number-4">1.4.19.</span> <span class="todo TODO">TODO</span> Joker</h4>
<div class="outline-text-4" id="text-1-4-19">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 22:45] </span></span> &lt;- <a href="#org496595f">Joker - Juggernaut</a>
</p>
<p>
One of the dubstep goats for sure
</p>
</div>
</div>
</div>
<div id="outline-container-org3116051" class="outline-3">
<h3 id="org3116051"><span class="section-number-3">1.5.</span> Albums etc.</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org6457111" class="outline-4">
<h4 id="org6457111"><span class="section-number-4">1.5.1.</span> <a href="#orgcc4558c">Ruff Sqwad</a> - White Label Classics</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
<p><iframe width="440" height="335" src="https://www.youtube.com/embed/JI501loMDjE&list=OLAK5uy_mC776hXD43TTbvSjDTB9K9fGytbwVVsCk" frameborder="0" allowfullscreen></iframe></p>
Lots of classic instrumentals, imo chill and almost melancholic vibes compared to the cold eskibeat sounds
for example, but there&rsquo;s lots of overlap too with tunes like <a href="#org98e4c9f">Ruff Sqwad - Pied Piper</a>.
Also included:
</p>
<ul class="org-ul">
<li><a href="#org59366d8">Ruff Sqwad - Together</a></li>
<li><a href="#orgaeaba14">Ruff Sqwad - Functions on the Low</a></li>
<li><a href="#org66197b1">Ruff Sqwad - Xtra</a></li>
<li><a href="#org5bd5f36">Ruff Sqwad - Tings in Boots</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd67243b" class="outline-3">
<h3 id="orgd67243b"><span class="section-number-3">1.6.</span> Crews</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org54f204f" class="outline-4">
<h4 id="org54f204f"><span class="section-number-4">1.6.1.</span> <span class="todo TODO">TODO</span> Roll Deep</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 00:35] </span></span> &lt;- <a href="#org2955415">- Morgue</a>
</p>
</div>
</div>
<div id="outline-container-org73704b5" class="outline-4">
<h4 id="org73704b5"><span class="section-number-4">1.6.2.</span> <span class="todo TODO">TODO</span> Musical Mob</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:32] </span></span> &lt;- <a href="#orgd7ed4f8">- Pulse XYZ</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:21] </span></span> &lt;- <a href="#orga7a9632">Musical Mob - Pulse X</a>
</p>
</div>
</div>
<div id="outline-container-orgcc4558c" class="outline-4">
<h4 id="orgcc4558c"><span class="section-number-4">1.6.3.</span> <span class="todo TODO">TODO</span> Ruff Sqwad</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:10] </span></span> &lt;- <a href="#orgb2d8a0d">Misty Cold</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:09] </span></span> &lt;- <a href="#org9932afb">- Misty Cold (~2003)</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:05] </span></span> &lt;- <a href="#org09f817c">Tinchy Stryder</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:05] </span></span> &lt;- <a href="#org1f5171e">Slix</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:04] </span></span> &lt;- <a href="#orgb22977f">Tings in Boots (vocal ver)</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:02] </span></span> &lt;- <a href="#org5bd5f36">Ruff Sqwad - Tings in Boots</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 14:02] </span></span> &lt;- <a href="#org5bd5f36">- Tings in Boots</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:55] </span></span> &lt;- <a href="#org66197b1">- Xtra</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:51] </span></span> &lt;- <a href="#orgaeaba14">- Functions on the Low</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:49] </span></span> &lt;- <a href="#org59366d8">- Together</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:48] </span></span> &lt;- <a href="#orgf7d9379">Rapid</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:46] </span></span> &lt;- <a href="#org98e4c9f">- Pied Piper</a>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:44] </span></span> &lt;- <a href="#org6457111">White Label Classics</a>
</p>
<p>
Formed around 2001, pretty influential instrumentals.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbd00146" class="outline-3">
<h3 id="orgbd00146"><span class="section-number-3">1.7.</span> Styles</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orgdac2716" class="outline-4">
<h4 id="orgdac2716"><span class="section-number-4">1.7.1.</span> <span class="todo TODO">TODO</span> 8-bar</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-02-21 Mi 13:25] </span></span> &lt;- <a href="#orga7a9632">Musical Mob - Pulse X (January 2002)</a>
</p>
<p>
Early 2000s style from the transitionary period between garage and grime.
Named after its A/B structure with each part 8 bars long which lended itself very well to fast-paced MCing in larger crews with 8 or 16-bar verses for each member.
</p>
</div>
</div>
<div id="outline-container-org4da5b1c" class="outline-4">
<h4 id="org4da5b1c"><span class="section-number-4">1.7.2.</span> <span class="todo TODO">TODO</span> Weightless</h4>
<div class="outline-text-4" id="text-1-7-2">
</div>
</div>
</div>
</div>
</div>
</body>
</html>